Repository: rinino/myScoterFlutter
Catalog: lib/l10n/app_*.arb
Languages: it

source: My Scooters
it: I Miei Scooter

# noScooterFound
source: No scooters found.
it: Nessuno scooter trovato.

# addScooterPrompt
source: Press "+" to add one!
it: Premi "+" per aggiungerne uno!

source: DELETE
it: ELIMINA

source: CANCEL
it: ANNULLA

source: SAVE
it: SALVA

# deleteScooterTitle
source: Delete Scooter
it: Elimina Scooter

# deleteScooterContent
source: Are you sure you want to delete the scooter {modello}? This action will also delete all its refuelings.
it: Sei sicuro di voler eliminare lo scooter {modello}? Questa azione cancellerà anche tutti i rifornimenti.

source: Brand
it: Marca

source: Model
it: Modello

source: Displacement
it: Cilindrata

# mixer
source: Oil Mixer
it: Miscelatore

source: Yes
it: Sì

source: REFUELINGS
it: RIFORNIMENTI

source: No data present
it: Nessun dato presente

source: Share photo
it: Condividi foto

source: Save to gallery
it: Salva in galleria

source: Scooter updated!
it: Scooter aggiornato!

source: Refueling saved!
it: Rifornimento salvato!

source: Add Scooter
it: Aggiungi Scooter

source: Edit Scooter
it: Modifica Scooter

source: License Plate
it: Targa

source: Year
it: Anno

# tankCapacity
source: Tank Capacity (L)
it: Capacità Serbatoio (L)

source: Select Image
it: Seleziona Immagine

source: Camera
it: Fotocamera

source: Gallery
it: Galleria

source: Remove Photo
it: Rimuovi Foto

# missingFields
source: Please fill in all required fields
it: Compila tutti i campi obbligatori

# insertBrand
source: Enter brand
it: Inserisci la marca

# insertModel
source: Enter model
it: Inserisci il modello

source: Refueling Details
it: Dettagli Rifornimento

source: Date
it: Data

source: Current Km
it: Km Attuali

source: Gas Liters
it: Litri Benzina

source: Oil Liters
it: Litri Olio

source: None
it: Nessuno

source: Oil Percentage
it: Percentuale Olio

source: Km Traveled
it: Km Percorsi

source: Average Consumption
it: Media Consumo

# averageConsumptionCalcTitle
source: Average Consumption Calculation
it: Calcolo Consumo Medio

# averageConsumptionCalcDesc
source: The average consumption is calculated by dividing the kilometers traveled since the last refueling by the liters of gas inserted in this refueling. It is assumed that the tank is filled up at each refueling.
it: Il consumo medio viene calcolato dividendo i chilometri percorsi dall'ultimo rifornimento per i litri di benzina inseriti in questo rifornimento. Si assume che ad ogni rifornimento venga fatto il pieno.

source: Add Refueling
it: Aggiungi Rifornimento

source: Edit Refueling
it: Modifica Rifornimento

source: Select Date
it: Seleziona Data

# dateTime
source: Date and Time
it: Data e Ora

source: Oil added?
it: Olio aggiunto?

source: Save Refueling
it: Salva Rifornimento

# deleteRecordTitle
source: Delete
it: Elimina

# deleteRecordContent
source: Do you want to delete this record?
it: Vuoi eliminare questo record?

# generalInfo
source: GENERAL INFORMATION
it: INFORMAZIONI GENERALI

source: DETAILS
it: DETTAGLI

# autoMixer
source: Automatic Oil Mixer
it: Miscelatore Automatico

# autoMixerDesc
source: Enable if the scooter mixes oil automatically
it: Attiva se lo scooter gestisce l'olio da solo

source: Required field
it: Campo obbligatorio

# insertNumber
source: Please enter a valid number
it: Inserire un numero

# invalidLicensePlate
source: Invalid license plate format
it: Formato targa non valido

# invalidYear
source: Invalid year (between 1900 and today)
it: Anno non valido (es. compreso tra 1900 e oggi)

# impostazioni
source: Settings
it: Impostazioni

# aspetto
source: Appearance
it: Aspetto

# lingua
source: Language
it: Lingua

# informazioni
source: Information
it: Informazioni

# versione
source: Version
it: Versione

# termini_condizioni
source: Terms and Conditions
it: Termini e Condizioni

# fatto
source: Done
it: Fatto

# legale
source: Legal
it: Legale

# maggiori_info
source: More Information
it: Maggiori Informazioni

# leggi_sito
source: Read on website
it: Leggi sul sito

# info_text
source: To know the details about data management and terms of use, visit our official website.
it: Per conoscere i dettagli sulla gestione dei dati e i termini d'uso, visita il nostro sito ufficiale.

# info_dati
source: The app does not collect personal data on external servers. Everything is saved locally.
it: L'app non raccoglie dati personali su server esterni. Tutto viene salvato localmente.

# sistema
source: System
it: Sistema

# chiaro
source: Light
it: Chiaro

# scuro
source: Dark
it: Scuro

# errorSharing
source: Error while sharing
it: Errore durante la condivisione

# errorSaving
source: Error while saving
it: Errore durante il salvataggio

source: Error loading refuelings
it: Errore nel caricamento dei rifornimenti

# errorDeleting
source: Error while deleting
it: Errore durante l'eliminazione

# recordDeleted
source: Record successfully deleted
it: Record eliminato con successo

source: Permission denied
it: Permesso negato

# imageSaved
source: Image saved to gallery!
it: Immagine salvata nella galleria!

# errorUpdating
source: Error while updating
it: Errore durante l'aggiornamento

# scooterAdded
source: Scooter added successfully!
it: Scooter aggiunto con successo!

source: Scooter deleted
it: Scooter eliminato

# licensePlateShort
source: Plate
it: Targa

# shareText
source: Check out my {scooter}!
it: Guarda il mio {scooter}!

# shareSubject
source: Scooter Photo
it: Foto Scooter
